#include "Header.h"
int main()
{

	/*1) Від 1 до n.
	Дано натуральне число n. Виведіть усі числа від 1 до n.
	Вхід: 5
	Вихід: 1 2 3 4 5*/
	/*
	int num;
	cout << "enter number: ";
	cin >> num;

	onedigit(num);
	*/
	


	/*2) Від A до B.
	Дано два цілих числа A і B. Виведіть усі числа від A до B включно, у порядку зростання, якщо A < B, 
	або в порядку зменшення в протилежному випадку.
	Вхід: 5 1
	Вихід: 5 4 3 2 1*/
	/*
	int num1, num2;
	cout << "enter 2 numbers: \n";
	cin >> num1 >> num2;

	twodigits(num1, num2);
	*/



	/*10) Ступінь числа.
	Обчисліть ступінь числа, використовуючи рекурсію. У функцію передається 2 параметри — число і ступінь.*/
	/*
	int num, extent;
	cout << "enter number and the degree: \n";
	cin >> num >> extent;

	cout << degree(num, extent);
	*/
	


	/*11) Сума чисел у діапазоні.
	Обчисліть суму чисел у певному діапазоні. Початок та кінець діапазону задаються параметрами функції.*/
	/*int num1, num2;
	cout << "enter 2 numbers: \n";
	cin >> num1 >> num2;

	cout << SumInRange(num1, num2);*/
	


	/*9) Числа Фібоначчі.
	Напишіть функцію для обчислення елементів ряду чисел Фібоначчі, спираючись на рекурентне рівняння F(n) = F(n-1) + F(n-2).
	Функція приймає індекс числа, повертає значення числа.*/
	/*
	int num;
	cout << "enter number: ";
	cin >> num;

	cout << fibonacci(num);
	*/
	


	/*4) Сума цифр числа.
	Дано натуральне число N. Обчисліть суму його цифр.
	При вирішенні цієї задачі не можна використовувати рядки, списки, масиви, глобальні змінні (ну й цикли, звісно).*/
	/*
	int num;
	cout << "enter number: \n";
	cin >> num;

	cout << DigSum(num);
	*/
}